[
  {
    "url": "https://www.businesstoday.in/markets/stocks/story/infosys-wipro-tcs-coforge-birlasoft-techm-hcl-tech-mphasis-ltimindtree-q1-results-preview-things-to-watch-434419-2024-06-24?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": "Nirmal Bang Institutional Equities in its IT sector preview note said June would be a decent quarter for 11 IT firms including Infosys Ltd, Wipro Ltd, Tata Consultancy Services, Coforge Ltd, Birlasoft Ltd, LTIMindtree Ltd and Mphasis, among others. It said elevated PE multiples of tier-1 and tier-2 IT players are either a sign that there is an earnings upgrade cycle in the offing for FY25 and/or that flows into equities are strong. \"We think FY25 consensus earnings still likely have a modest downside and a strong pick-up in FY26 is already factored in,\" it said. For tier 1 IT players, all eyes would be on whether companies are pointing to any green-shoots in discretionary spending and by when do they expect a pick-up in demand. Besides, it would be seen whether the total contract value (TCV) to revenue conversion problem persists and status of mega/large deal ramp-ups as there have been project cancellations and pauses in the past six months. Lastly, any commentary on when will hiring start would be keenly watched. Among tier 2 IT firms, eyes would be on whether the mortgage BFS segment recovering for Mphasis, whether Persistent Systems continue to deliver high TCV numbers and Coforge's update on the Cigniti acquisition. Will Birlasoft continue to deliver decent growth in FY25 too, and Zensar's revenue and margin outlook for FY25 will also be keenly watched. After a 410 bps outperformance by Nifty IT against Nifty in 2023, it has underperformed by 910 bps tear-to-date, although it has recovered 630 bps on month-to-date basis. \"All players are likely to hold on to their revenue and margin guidance as of now. The 2HFY25 rebound hope is at risk due to: (1) US interest rates remaining higher for longer (2) Expectations of dramatic changes in economic policies post US elections in Nov. 2024 – especially around tariffs if Donald Trump wins. The announcement on large deal wins by Indian IT players have been relatively muted since September 2023,\" it said. Nirmal Bang kept its ‘Underweight’ stance on the IT sector as it believes that it is in a ‘slower for longer’ demand environment and the risk is for current consensus estimates to be cut rather than raised. For TCS, it expects 1 per cent revenue growth QoQ in constant currency (CC) terms, backed by strong order inflow of the last 12 months. It is likely to face cross-currency headwind of 50 bps on QoQ basis. \"For 1QFY25, we think that EBIT margin will contract by 210 bps QoQ to 23.9 per cent. Margins will contract on the back of salary hikes which are effective from 1st April, 2024. Another headwind can be sub-contractor cost which was at 4.6 per cent of revenue in 4QFY24 and may move up depending on demand conditions,\" it said. TCS' TCV for 1QFY25 is seen coming in above the guided range of $7-9 billion. In the case of Infosys, the IT firm is seen reiterating revenue growth guidance for FY25 in the 1-3 per cent CC range. Margin guidance will continue to remain in the 20-22 per cent range, Nirmal Bang said. \"We expect Infosys to report a revenue growth of 2.5 per cent QoQ in CC terms. The company had talked about normal revenue seasonality on its 4QFY24 call. It will face cross currency headwinds of ~50bps. We expect EBIT margin to remain flat QoQ at 20.1 per cent as there are no major factors for margin movement,\" Nirmal Bang said. The brokerage sees TCV number in the $3-4 billion range. In the case of HCL Technologies Ltd, Nirmal Bang expects revenue growth guidance for FY25 at 3-5 per cent in CC terms to be maintained as discretionary spending continues to remain low. It expects margin guidance to remain unchanged at 18-19 per cent EBIT. \"We estimate (0.5 per cent) CC QoQ revenue growth in 1QFY25 as against (1.5 per cent) to 0.5 per cent CC growth guidance, putting us exactly at the mid-point of the guidance. There will be a cross-currency headwind of 70bps,\" Nirmal Bang said on Wipro. Nirmal Bang expects Tech Mahindra to deliver 1 per cent CC QoQ growth, which will be impacted by weakness in the CME vertical (37 per cent of sales), although slight improvements are being seen. In 1QFY25, it expects TechM's TCV to be higher than the 4QFY24 TCV of $500 million after remaining below the guided range of $700-1000 million for the 5th consecutive quarter. "
  },
  {
    "url": "https://www.businesstoday.in/markets/stock-picks/story/infosys-tcs-wipro-hcl-tech-techm-ltim-emkay-global-shares-its-pecking-order-stock-price-targets-431102-2024-05-28?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": "Emkay Global in its latest note said IT stocks’ earnings downgrade may bottom out in H1FY25, if the current expectations on interest rate cut materialise. It said the recent correction in IT stocks have made valuations more reasonable, adding that its preference is for large caps such as Infosys Ltd, HCL Technologies Ltd and Wipro Ltd over midcaps, considering relative valuation. Emkay Global said the disappointing FY25 guidance reflects muted demand with weak discretionary spending, and lack of demand recovery visibility in the near term. The management commentary, it said, remained unchanged with recovery timelines still uncertain and recovery hopes pushed back to 2025/2026. Infosys has guided for revenue growth of 1-3 per cent constant currency (CC) growth in FY25 (implying CQGR of 1.1-1.9 per cent), suggesting that discretionary spending remains weak as seen in H2FY24. It expects the normal seasonality to play out in FY25 per its guidance, i.e. H1 to be stronger than H2. HCL Tech guided for 3-5 per cent CC revenue growth in FY25 (implying CQGR of -0.1 per cent to 0.6 per cent). The FY25 revenue growth guidance came weaker than expected, factoring muted growth in H1, and no material improvement in discretionary spending. After a weak start in Q1, HCL Tech’s guidance implies a 1-2.5 per cent CQGR over Q2-Q4 to reach the FY25 growth guidance, Emkay said. Wipro has guided for minus 1.5 per cent to 0.5 per centrevenue growth in Q1, with the mid-point of the guidance being 50bps lower than Emkay's estimate. LTIM suggested that growth will return from Q1 onwards, despite the overall discretionary spending environment being similar to that of FY24 \"Consequently, earnings downgrade cycle continued in this quarter as well, although the overall pace of earnings downgrades slowed. Deal mix continued to be aligned toward cost optimization with digital transformation still on the back burner. Margin resilience continued on the back of higher utilisation, subcon optimisation, and tighter control over discretionary spends,\" it said. The Fed’s recent minutes of meeting indicate that an interest cut in the near term is unlikely, which can potentially push out demand uptick. Emkay said the start of interest rate-cut cycle would act as a signaling trigger for clients to gain confidence on the inflation trajectory and macro stability, which may drive demand recovery and an uptick in discretionary spending Its pecking order is Infosys Ltd, HCL Technologies Ltd, Wipro Ltd, Tech Mahindra Ltd (TechM), Tata Consultancy Services Ltd (TCS), and LTIMindtree Ltd (LTIM) in largecap IT stocks. Among midcaps, it likes Cyient Ltd, Birlasoft Ltd, Firstsource Solutions Ltd and Mphasis Ltd. "
  },
  {
    "url": "https://www.businesstoday.in/markets/stocks/story/maruti-suzuki-techm-icici-bank-hcl-tech-which-nifty-stock-to-buy-post-q4-results-427383-2024-04-29?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": "The majority of Nifty companies, which have announced their results till date, have reported growth in their net profit and gross sales numbers for the quarter ended March 2023. Analysts on Dalal Street are also bullish on a couple of Nifty firms after their Jan-March quarter results. Starting from the auto sector, Maruti Suzuki posted a 47.05% year-on-year (YoY) rise in net profit at Rs 3,952.20 crore in Q4FY24. The auto major posted a 19.10% rise in gross sales at Rs 36,694.20 crore during the quarter under review. Net profit of Bajaj Auto also increased 17.99% YoY to Rs 2,011.43 crore. Brokerage Sharekhan is positive on Maruti Suzuki (MSIL) with a price target of Rs 14,434, indicating an upside of 13% from the current market price. “MSIL reported slightly better-than-expected adjusted EBITDA margin on account of favourable operating leverage and fall in average discount per vehicle, which was partly offset by the rise in steel prices (2% QoQ). We maintain our ‘Buy’ rating on the stock with a revised price target in expectation of the improvement in operating performance and structural upward shift in its product mix,” Sharekhan said in a report. In the banking and NBFC space, Axis Bank posted a consolidated profit of Rs 7,599 crore in Q4FY24 against a consolidated loss of Rs 5,361.85 crore in the same quarter last year. YES Securities is positive on Axis Bank with a price target of Rs 1,440. Private banking majors HDFC Bank and ICICI Bank also reported a 39.92% and 18.46% YoY rise in net profit at Rs 17,622.38 crore and Rs 11,671.52 crore during the quarter under review. Motilal Oswal has set a target price of Rs 1,950 for HDFC Bank. “Over FY24-26, we estimate HDFC Bank to deliver 13.5% and 18% CAGR in loans and deposits and 16% CAGR in earnings, translating into RoA and RoE of 1.9% and 15.5%, respectively, by FY26. On the other hand, Sharekhan is bullish on ICICI Bank with a price target of Rs 1,300. “ICICI Bank relatively well positioned among large private peers. NIM pressure in the near term and a gradual normalisation of credit costs in the near to medium term would be offset by moderation in operating expenses growth thus, we see the bank sustaining RoA over 2% in the near to medium term. The bank is on the path of delivering a sustainable and predictable earnings growth trajectory,” Sharekhan said. Among the other major Nifty companies, IndusInd Bank, Bajaj Finance, Bajaj Finserv, HDFC Life Insurance, SBI Life Insurance and Shriram Finance have posted a growth of 14.96%, 21.11%, 19.76%, 13.72%, 4.37% and 56.30%, respectively, in their bottom line figures in Q4FY24. Sharekhan has set a price target of Rs 2,040 for Bajaj Finserv, while Emkay Global Financial is positive on Shriram Finance with a price target of Rs 2,850. In the information technology space, the consolidated net profit of Tech Mahindra and Wipro declined 40.86% YoY and 7.80% YoY, respectively for the quarter ended March 2024. Gross sales of these IT majors also declined up to 6% YoY. On the other hand, IT major Tata Consultancy Services posted a 9.15% rise in net profit on a 3.51% increase in gross sales in Q4FY24. The bottom line of Infosys also grew 30.04% YoY to Rs 7969 crore in Q4FY24. Net profit of HCL Technologies stood almost flat at Rs 3,986 crore (up 0.08% YoY). On the other hand, net profit of LTIMindtree inched lower by 1.24% to Rs 1,099.90 crore during the quarter under review. As many as 21 Nifty companies have reported their Q4FY24 results till April 28. Sharekhan is positive on HCL Technologies and Tech Mahindra with a price target of Rs 1,670 and 1405, respectively. Sharing its view on Tech Mahindra, Sharekhan said, “The company aims to achieve top-line growth above peers in FY27 with EBIT margin exceeding 15% from 6.1% in FY24. It expects to achieve $250 million savings each year for the next three years. The organisational restructuring and the strategy initiatives under the three-year program undertaken by the new CEO would aid in gradual turnaround in the initial phase followed by steady incremental gains in the later phase.” Energy-to-telecom behemoth Reliance Industries (RIL) witnessed a drop of 1.80% in its consolidated net profit at Rs 18951 crore for the quarter ended March 2024. On the other hand, gross sales increased by 10.83% YoY to Rs 2,64,834 crore. Global brokerage Jefferies is positive on RIL with a revised target price of Rs 3,380 (Rs 3,140 earlier). “Retail growth was soft though balance sheet improved and net debt declined aided by capital raise and asset divestiture. Jio was ahead on higher ARPUs due to an improved subscriber mix. O2C profitability rose on robust refining while petchem was subdued. Peak capex appears behind, FCF improved and net debt fell 6% YoY,” Jefferies said. FMCG firm Nestle reported 26.81% YoY growth in net profit at Rs 934.17 crore in Q4FY24. On the other hand, Tata Consumer Products and Hindustan Unilever witnessed a decline of 19.35% and 1.62% YoY in their respective consolidated net profit at Rs 216.63 crore and Rs 2,558 crore. "
  },
  {
    "url": "https://www.businesstoday.in/markets/company-stock/story/techm-shares-jump-13-post-q4-results-see-brokerages-tech-analyst-views-427063-2024-04-26?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": "Tech Mahindra Ltd shares traded with sharp gains in Friday's deals. The stock jumped 13.01 per cent to hit a high of Rs 1,344.95. It was last seen trading 8.99 per cent higher at Rs 1,297.05. Today's sharp rise in the share price came despite the IT company's weak fourth-quarter (Q4 FY24) results. TechM reported a 41 per cent fall in profit for the quarter ended March 2024. Net profit slipped to Rs 664.2 crore in Q4 FY24 against Rs 1,125 crore in the year-ago period. Consolidated revenue slipped 6.2 per cent year-on-year (YoY) to Rs 12,871 crore in the March quarter. Technical analysts said immediate support on the counter will be at Rs 1,300-1,290 levels. \"A decisive close above Rs 1,300 level can trigger the stock towards the Rs 1,350-1,400 zone. Keep a strict stop loss placed at Rs 1,240,\" Ratnesh Goyal, Head of Technical Analysis at Arihant Capital, told Business Today TV. \"TechM's stock could face resistance near Rs 1,340. Immediate support will be at Rs 1,290,\" said Kiran Jani, Head of Technical Research at Jainam Broking. Brokerage views \"Given the demand within communications remained weak and unstable, we believe the company's laid out strategy to drive balanced portfolio mix with reduced dependency on communications is a positive. However, the cyclicality of its portfolio business and weakness across its business units seem to be challenging, hence we would wait for early sign of recovery before we turn positive on the name,\" Prabhudas Lilladher (PL) said. Domestic brokerage PL has given a 'Hold' rating with a downward target price of Rs 1,135. \"The stock is currently trading at 20x FY26e, we are assigning P/E of 19x to FY26e with a target price of Rs 1,135. With that we assume coverage on TechM with a 'HOLD' rating,\" it stated. Nuvama Institutional Equities said, \"The (company's) new CEO, Mohit Joshi, laid out his FY27 strategy to take TechM ahead of peers' average growth and to a 15 per cent EBIT margin. While these targets are achievable, we argue the steps needed to achieve them will incur significant near-term pain. We are trimming FY25E/26E by -2 per cent/-1.5 per cent.\" \"While we welcome the vision and strategy of the new CEO, we believe the same will be quite challenging. Growth will be difficult with telecom still forming 36 per cnet of revenue while margins are likely to face headwinds (of building bench strength, investing in growth, etc) before tailwinds. We continue to expect near-term pain. Maintain 'Reduce',\" Nuvama further stated. The brokerage has assigned a 12-month target price of Rs 1,000 for TechM shares, down 25.65 per cent from today's high level of Rs 1,344.95. "
  },
  {
    "url": "https://www.businesstoday.in/markets/company-stock/story/tech-mahindra-shares-climb-10-on-ceos-fy27-roadmap-should-you-buy-stock-427020-2024-04-26?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": "Shares of Tech Mahindra Ltd (TechM) rallied 10 per cent in Friday's trade despite the IT major's weak set of March quarter results. The stock gained as the new CEO Mohit Joshi announced his vision for FY27, with goals to outgrow peers in revenue growth and achieve EBIT margin of 15 per cent by FY27. TechM is also aiming for a 30 per cent-plus ROCE profile and expects to return over 85 per cent of free cash flow (FCF) by FY27. The focus, Motilal Oswal noted, will be on scaling large accounts, winning multi-tower deals, driving synergies from past acquisitions, improving the cost structure, and achieving profitable and predictable growth. The results of new strategy would be keenly watched before any re-rating, Motilal Oswal said as it remains on the sidelines saying the he current TechM valuations fairly factors in the uncertainties around growth and margin. This brokerage sees the stock at Rs 1,210. Nuvama said while these targets are achievable, the steps needed to achieve them will incur significant near-term pain. This brokerage has trimmed its FY25 and FY26 earnings estimates by 1.5-2 per cent. It continues to rate TechM as ‘REDUCE’, with an unchanged target of Rs 1,000, valuing the stock at 16 times FY26E PE. Shares of Tech Mahindra jumped 10 per cent to hit a high of Rs 1,309.10 on BSE. Nirmal Bang said the reversion to the 15 per cent EBIT margin has been indicated to be in FY27 rather than in FY26 that it was pencilling in. \"We were 200 bps higher than the consensus. However, this margin number is higher than the 13.9 per cent that the consensus is currently working with in FY27. Hence there could be EPS upgrades for FY27,\" it said. A PE multiple expansion will offset EPS cuts, Nirmal Bang said as it suggested a target price of Rs 1,417 on the stock. Tech Mahindra’s Q4FY24 results reflect the ongoing weak demand environment, leading companies to focus on improving margins through cost optimisation. \"However, the inability to decrease subcontracting expenses and lower utilization makes us wary of the company’s approach towards efficiently managing resources. The reduction in client spending has dented the company’s performance despite achieving healthy growth in deal signings during the quarter,\" said DK Mudaraddi, Research Analyst, StoxBox. For FY25, the management looks forward to improvement in clients spending, which fuels optimism for a better revenue performance ahead, said Choice Broking. \"It is confident that their actions will lead to steady earnings growth in the coming years. As a result, we upgrade our rating to BUY while arriving at a target price of Rs 1,273 implying a P/E of 21x (modified) on FY26E EPS of Rs 61,\" the brokerage said. Key monitorables going forward would include - FY25E sales growth & margin outlook, demand commentary related to 5G technology, ramp-up of new businesses, deal pipeline, client decision-making for the same, and strategy roadmap under the leadership of a newly appointed CEO.  "
  },
  {
    "url": "https://www.businesstoday.in/markets/stock-picks/story/tata-steel-jsw-steel-techm-airtel-bpcl-5-nifty-firms-that-may-report-over-10-fall-in-q4-profit-424847-2024-04-09?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": "Tech Mahindra Ltd (TechM), Bharti Airtel Ltd, Reliance Industries Ltd (RIL), Tata Steel Ltd, JSW Steel Ltd, ITC Ltd, Larsen & Toubro, SBI Life Insurance Ltd and Axis Bank Ltd are among 15 Nifty constituents that could report a fall in year-on-year (YoY) profit in the March quarter, Motilal Oswal Securities suggested. Among these companies, two steelmakers Tata Steel and JSW Steel, IT major TechM, telecom operator Bharti Airtel Ltd and oil marketing company BPCL are seen reporting 10-60 per cent drop in YoY profit. In total, 50 Nifty companies are expected to report 6 per cent YoY growth in bottom lines. Tata Steel (down 4.9 per cent) and JSW Steel (down 1.7 per cent) have seen FY25 earnings downgrades since December quarter results; BPCL has seen a marginal earnings upgrade; while there has been no changes to TechM and Bharti Airtel FY25 earnings estimates so far. Motilal Oswal sees JSW Steel's profit falling 58 per cent to Rs 1,534.90 crore on 4.6 per cent YoY drop in sales at Rs 44,791 crore. Tata Steel may log 37.7 per cent drop in profit at Rs 1,054 crore on 2.8 per cent YoY fall in sales at Rs 61,228 crore. In the case of Tata Steel, the management commentary on European operations is critical. Its guidance on ASP and CoP across geographies will be monitored. For JSW Steel, coal costs are expected to remain at elevated levels in 4QFY24. The management commentaries on capex and performance of domestic and overseas subsidiaries will be crucial, Motilal Oswal said. Motilal Oswal sees TechM logging 30.6 per cent YoY drop in profit at Rs 923.20 crore on 3.5 per cent fall in sales at Rs 13,232 crore. Motilal Oswal said revenue growth for TechM is expected to be muted at 0.7 per cent QoQ CC due to weakness in both CME and Enterprise verticals. \"Deal wins are likely to be muted due to macro uncertainty. We expect deal TCV to the tune of $500 million in 4Q. Margins are likely to improve 140 bps QoQ, as the impact of cost-control efforts should start becoming visible,\" the domestic brokerage said. Bharti Airtel is seen reporing 15 per cent YoY drop in profit at Rs 2,199 crore. The telecom operator is seen reporting sales of Rs 38,860 crore, up 7.9 per cent. BPCL is seen reporting 15.9 per cent YoY fall in profit at Rs 6,362 crore on flattish sales at Rs 1,18,178 crore. "
  },
  {
    "url": "https://www.businesstoday.in/markets/company-stock/story/q4-results-infosys-march-quarter-earnings-on-april-18-here-are-dates-for-hdfc-bank-techm-wipro-icici-bank-423640-2024-04-01?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": "Earnings season is set to kick off within two weeks from now. While not all largecap companies have announced results dates, data compiled from stock exchanges showed Tata Consultancy Services (TCS) will be reporting its March quarter results on April 12. ICICI Lombard General Insurance Company Ltd and Angel One Ltd will be announcing their March quarter results on April 17. The fourth quarter results for Infosys and ICICI Securities Ltd will be out on April 18. HDFC AMC Ltd will announce its March quarter earnings on April 19 while HDFC Bank Ltd will declare its quarterly results on April 20. TCS, Angel One, ICICI Lombard Q4 earnings TCS will kick start the earnings season on April 12. The earnings conference call for the March quarter will take place t 7.30 pm on the same day. ICICI Lombard recently held an analyst meet to outline its key initiatives in the digital space that will be a vital part of its strategy for improving growth and profitability going ahead. In the medium term, efficiencies from these investments, along with scale benefits, are seen boosting profitability for ICICI Lombard. For now, Motilal Oswal Securities has a 'BUY' rating on the stock with a one-year target price of Rs 2,000. Infosys Q4 results preview In the case of Infosys, broking firm Nirmal Bang expects Infosys to report a total contract value (TCV) in the range of $2-3 billion for the March quarter. It believes Infosys may guide for a 4-7 per cent constant currency revenue growth for FY25 with modestly positive demand commentary against FY24, especially on discretionary spending. Besides, the domestic brokerage expects investors to watch out for guidance for FY25, the timing and extent of salary hikes in FY25 and the extent of boost from the margin improvement program in FY25. Angel Broking saw its client base rising 4.9 per cent month-on-month in February and 60.8 per cent on yearly basis. Client base stood at 2.14 crore at February end against 2.04 crore in January end and 1.33 crore at the end of February 2023, Angel One said last month. TechM, HCLTech, ICICI Bank Q4 results Among other key results, Persistent Systems Ltd will be out with it Q4 results on April 22; ICICI Prudential Life Insurance will disclose its quarterly earnings on April 23 while Nestle India Ltd, Tech Mahindra Ltd (TechM), Mphasis and UTI AMC will announce their results on April 25. HCL Technologies Q4 results will be out on April 26, ICICI Bank and IDFC First Bank's will be released on April 27 while KPIT Technologies and UltraTech Cement will announce earnings on April 29. Coforge Ltd results will be released on May 2, Kansai Nerolac on May 4, Dr Reddy's Labs on May 7, Asian Paints on May 9 and JSW Steel on May 17. "
  },
  {
    "url": "https://www.businesstoday.in/markets/trending-stocks/story/tcs-infosys-wipro-hcl-tech-techm-shares-it-outlook-ahead-of-us-elections-rate-cuts-421124-2024-03-12?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": "IT stocks: There has been a moderation in the quantum of Fed rate cuts (now three) that stock investors globally are looking at by the remainder of this calendar. The recent guidance by Accenture’s and Capgemini were seemingly weak and, US elections in November -- the ex-US president Donald Trump is ahead of Joe Biden in surveys, is adding an additional layer of uncertainty. Nirmal Bang Institutional Equities said there is a further scope of downside revision in Indian IT earnings. The BSE IT index has risen 2 per cent in 2024 so far, in line with the BSE Sensex. The largest IT player Tata Consultancy Services (TCS) shares have rallied 10.20 per cent during this period. The second largest player Infosys has risen 4 per cent; HCL Technologies and Wipro, the next in line, have gained 8-11 per cent while Tech Mahindra (TechM) shares are flattish for the period. Nirmal Bang said the consensus view on the number of rate cuts in 2024 has moved from 6-7 (150-175 bps) about three months back when the US Fed first hinted at, to 3 cuts, in line with the Fed’s view. The recent hotter-than-expected inflation data has a few economists wondering if the next move of the Fed is going to be a raise! Even if one ignores this minority view, the question is whether a Fed funds rate cut from 5.25-5.5 per cent to 4.5-4.75 per cent (by 75bps) be good enough to entice enterprises to spend more. \"Up until 2022, enterprises and households have been used to significantly lower interest rates since the GFC. Accenture’s and Cap-gemini’s seemingly weak guidance for FY24/CY24 may see downward revisions (Accenture 2Q results due on 21st March, 2024). Guidance by both the firms assumes 4.5 per cent CQGR in 2HFY24/CY24,\" it said. On Trump's prospects, Nirmal Bang said the US presidential election in November is going to add to the uncertainty. It said Donald Trump has put out his economic and foreign policy agenda, which may pose uncertainty not only from first order effects but also from second order ones. \"While the race between Biden and Trump may be close, going by recent media polls, Trump seems to have a lead. For instance, businesses may be directly impacted by Trump’s tariff plan vis-à-vis not just China but also with other countries. Similarly, he has a dramatically different (to put it mildly) view on immigration compared to Biden. Both these plans, even if implemented in a diluted form, could put upward pressure on inflation,\" it said. \"However, there are also likely other measures – like negotiating a quick end to the Ukraine war and a more hydrocarbon-based energy plan that could have a deflationary impact, especially through the energy markets,\" Nirmal Bang added. Given the backdrop, Nirmal Bang said the current revenue assumptions seem aggressive in the context of industry commentary, the timing of turnaround in growth, prospects of US interest rate trajectory and uncertainty around US economic policies consequent to the presidential elections. \"We expect 4-7 per cent CC revenue growth guidance by both Infosys and HCL Technologies. Even this may be at risk if the Fed funds rate is not cut materially or if enterprise customers freeze up due to US election uncertainty. We see ‘slower for longer’ demand conditions through 2024 that could pare consensus earnings expectation,\" it said. Nirmal Bang, which has been unedrweight on IT sector since April 2020, said it believes that the starting valuations are expensive and can at best deliver mid to high single-digit total stock returns including capital return to shareholders for TCS and Infosys, as it believes structural earnings growth is being overestimated by the Street. \"We also expect margins for most companies to remain in a narrow band at around FY24 levels and not see a material expansion (except for Tech Mahindra where it starts from a very low base). Ceteris Paribus, this has valuation/return implications,\" it said. Nirmbal Bang said it has ‘SELL’ rating on all IT stocks under its coverage, except Tech Mahindra.  "
  },
  {
    "url": "https://www.businesstoday.in/bt-tv/market-today/video/gaurang-shahs-views-on-tcs-infosys-wipro-techm-decline-420350-2024-03-06?utm_source=topic&utm_medium=topic&utm_campaign=topic",
    "article": " The decline in IT company stocks could be attributed to various factors, including: Economic uncertainties, such as geopolitical tensions or trade disputes, can impact IT companies, especially those with significant exposure to international markets. IT companies often derive a significant portion of their revenue from exports. Fluctuations in currency exchange rates can affect their earnings, especially if the local currency strengthens against major foreign currencies. Market trends and investor sentiment may lead to a rotation out of technology stocks into other sectors perceived as offering better growth prospects. This rotation can result in selling pressure on IT stocks. Individual companies within the IT sector may face challenges such as weaker-than-expected earnings, loss of key contracts, or management issues, leading to a decline in their stock prices. Regulatory changes, both domestic and international, can impact IT companies, particularly those involved in areas such as data privacy, cybersecurity, or outsourcing. If IT stocks were perceived to be overvalued due to excessive speculation or unrealistic growth expectations, a correction in stock prices could occur as investors reassess their positions. These factors, either individually or in combination, may have contributed to the fall in IT company stocks. "
  }
]
