[{"url": "https://www.businesstoday.in/markets/company-stock/story/rvnl-shares-zoom-19-to-hit-record-high-today-heres-what-analysts-say-436027-2024-07-05?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Shares of Rail Vikas Nigam Ltd on Friday extended their gains for the third straight session. The stock today soared 18.94 per cent to hit an all-time high of Rs 498.05. It eventually settled 17.36 per cent higher at Rs 491.45. At this price, the multibagger scrip has gained 169.81 per cent in 2024 so far. The railway PSU has been securing fresh orders and signing meaningful pacts. It has recently signed a Memorandum of Understanding (MoU) with Delhi Metro Rail Corporation Ltd (DMRC). \"RVNL has signed MoU with Delhi Metro Rail Corporation Limited (DMRC) for participation in the upcoming projects in India and abroad as Project Service Provider for Metro, Railways, High Speed Rail, Highways, MegaBridges, Tunnels, Institutional Buildings/ Workshops or Depots, S&T works, and Railway Electrification,\" it stated in an exchange filing. Prior to this, the state-owned firm emerged as the lowest bidder a Central Railway contract worth Rs 132.59 crore. On technical setup, support on the counter could be seen at Rs 470. The counter looked strong on daily charts. It has potential to hit an upside target of Rs 520 in the near term. Keep stop loss placed at Rs 470,\" said Ravi Singh, Senior Vice-President (Retail Research) at Religare Broking. The expected trading range will be between Rs 425 and Rs 515 for the short term, said Jigar S Patel, Senior Manager - Technical Research Analyst at Anand Rathi Shares and Stock Brokers. RVNL is an executing arm of Indian Railways and works for and on behalf of the ministry to execute projects assigned to it. It works on a turnkey basis and undertakes the full cycle of project development from conceptualisation to commissioning including stages of design, preparation of estimates, calling and award of contracts, project and contract management. As of March 2024, the government held a 54.03 per cent stake in the rail PSU. "}, {"url": "https://www.businesstoday.in/markets/company-stock/story/rvnl-shares-rise-record-high-post-mou-with-delhi-metro-check-details-435931-2024-07-05?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Shares of state-run Rail Vikas Nigam Ltd (RVNL) rose to a record high in early deals on Friday after the railway PSU signed a Memorandum of Understanding (MoU) with Delhi Metro Rail Corporation Ltd. (DMRC) for participation in upcoming projects in India and abroad. RVNL shares rose 8.65% to Rs 455 against the previous close of Rs 418.75 on BSE. Market cap of the firm climbed to Rs 93,586 crore.Total 53.12 lakh shares of RVNL changed hands amounting to a high turnover of Rs 235.90 crore. \"RVNL has signed MoU with Delhi Metro Rail Corporation Limited (DMRC) for participation in the upcoming projects in India and abroad as Project Service Provider for Metro, Railways, High Speed Rail, Highways, MegaBridges, Tunnels, Institutional Buildings/ Workshops or Depots, S&T works, and Railway Electrification,\" according to an exchange filing. RVNL shares have a one-year beta of 1.5, indicating high volatility during the period. In terms of technicals, the relative strength index (RSI) of RVNL stands at 67.8, signaling it's trading neither in the overbought nor in the oversold zone. Rail Vikas Nigam shares are trading higher than the 5 day, 10 day, 20 day, 30 day, 50 day, 100 day, 150 day and 200 day moving averages. RVNL is an executing arm of Indian Railways and works for and on behalf of the ministry for projects assigned to it for execution. It works on a turnkey basis and undertakes the full cycle of project development from conceptualisation to commissioning including stages of design, preparation of estimates, calling and award of contracts, project and contract management. "}, {"url": "https://www.businesstoday.in/markets/company-stock/story/rvnl-shares-in-news-today-as-firm-inks-mou-with-delhi-metro-435900-2024-07-05?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Shares of state-run Rail Vikas Nigam Ltd (RVNL) are in news today after the PSU said it has inked a Memorandum of Understanding (MoU) with Delhi Metro Rail Corporation Ltd. (DMRC) for participation in upcoming projects in India and abroad. RVNL shares rose 0.46% to end at Rs 418.75 in the previous session on BSE. Market cap of the firm climbed to Rs 87,310 crore. Total 9.17 lakh shares of RVNL changed hands amounting to a turnover of Rs 38.76 crore. \"RVNL has signed MoU with Delhi Metro Rail Corporation Limited (DMRC) for participation in the upcoming projects in India and abroad as Project Service Provider for Metro, Railways, High Speed Rail, Highways, MegaBridges, Tunnels, Institutional Buildings/ Workshops or Depots, S&T works, and Railway Electrification,\" according to an exchange filing. RVNL shares have a one-year beta of 1.5, indicating high volatility during the period. In terms of technicals, the relative strength index (RSI) of RVNL stands at 67.8, signaling it's trading neither in the overbought nor in the oversold zone. Rail Vikas Nigam shares are trading higher than the 5 day, 10 day, 20 day, 30 day, 50 day, 100 day, 150 day and 200 day moving averages. RVNL is an executing arm of Indian Railways and works for and on behalf of the ministry for projects assigned to it for execution. It works on a turnkey basis and undertakes the full cycle of project development from conceptualisation to commissioning including stages of design, preparation of estimates, calling and award of contracts, project and contract management. "}, {"url": "https://www.businesstoday.in/markets/story/stocks-in-news-hdfc-bank-nephro-care-rvnl-idbi-bank-ircon-go-digit-and-raymond-435899-2024-07-05?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Indian headline indices ended on flat note on Thursday, after a strong opening, followed by profit booking in the select leading stocks. BSE Sensex added 62.87 points, or 0.08 per cent to end at 80,049.67. NSE's Nifty50 index gained 15.65 points, or 0.06 per cent, to settle at 24,302.15 for the day. Here are the stocks that may remain under spotlight before the opening bell on Friday, July 05, 2024: HDFC Bank: India's leading private lender said its gross advances registered a growth of 0.8 per cent YoY to Rs 24.87 lakh crore in the first quarter of FY25. The deposits were down 0.03 per cent to Rs 23.79 lakh crore, while the CASA deposits dropped 5 per cent to Rs 8.63 lakh crore. Nephro Care India: The Deepak Parekh-backed treatment center will make its debut on NSE's emerge platform on Friday, July 05. The company raised a total of Rs 41.26 crore via its IPO selling its shares for Rs 90 apiece. It will be the first stock to be listed at the bourses after NSE imposed a 90 per cent capping on listing price. IDBI Bank: The private lenders total business grew 15 per cent YoY to Rs 4.71 lakh crore in the June 2024 quarter. Total deposits rose 13 per cent to Rs 2.77 lakh crore. CASA deposits increased 5 per cent to Rs 1.34 lakh crore, while net advances were up 17 per cent for the quarter. Go Digit General Insurance: The recently listed general insurance company was visited by a team of officials from the Directorate General of GST Intelligence (DGGI), Bengaluru, seeking information regarding purchases made by the company from one of its vendors. According to the DGGI, the vendor was non-existent at its registered premises as per a discrete inquiry conducted. Poonawalla Fincorp: The shadow lender's disbursements grew 5 per cent to Rs 7,400 crore, while assets under management (AUM) were up 52 per cent at Rs 26,970 crore in the quarter ended June 30, 2024. Gross NPAs were below 1 per cent, while net NPAs came in below 0.5 per cent for the period. Raymond: The textile major announced the vertical demerger of its real estate business into its wholly owned subsidiary, Raymond Realty (RRL). After the completion of this demerger, Raymond and Raymond Realty will operate as separate listed entities within the Raymond Group, pending all statutory approvals. Mahindra Lifespace Developers: The Mahindra Group company is the preferred partner for the redevelopment of seven residential societies in Borivali West, Mumbai. This project offers an estimated gross development value of approximately Rs 1,800 crore. Ahluwalia Contracts: The real estate company has received an order worth Rs 572 crore from the Airports Authority Of India at Darbhanga Airport, Bihar. The order involves the construction of a new terminal building, allied structures, and external development works on an engineering procurement and construction (EPC) model. RVNL: The railways run PSU company has signed an MoU with Delhi Metro Rail Corporation (DMRC) for participation in upcoming projects in India and abroad as a project service provider. Ircon International: The railway company has received a LOA for the work of design, supply, installation, testing, and commissioning of broad gauge ballastless track (BLT), supply of ballast, and installation of track (excluding supply of rails and track sleepers) in Uttarakhand, from Rail Vikas Nigam (RVNL). Krsnaa Diagnostics: The Bhabha Atomic Research Centre, Government of India, has awarded the tender to the diagnostics firm for providing tele-reporting services for radiology at the BARC Hospital, Mumbai. CG Power & Industrial Solutions: The motor and generator manufacturing company has entered into a ‘Development Agreement’ with Skybound Realty, a K Raheja Corp group company, for the joint development of property CG House in Mumbai. BGR Energy Systems: The civil construction company has received approval from board members for the issuance of equity shares worth up to Rs 1,000 crore via rights issue to eligible equity shareholders. Lloyds Metals & Energy: The metal company launched its qualified institutions placement (QIP) issue on July 4, with a floor price of Rs 732.08 per share. "}, {"url": "https://www.businesstoday.in/markets/stocks/story/rvnl-ircon-rites-titagarh-jupiter-wagons-antique-shares-q1-results-preview-for-railways-cos-picks-2-stocks-435754-2024-07-04?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Antique Stock Broking in its Q1 results preview note said railways as a sector has continue to enjoy increased allocation in the fiscal budget. It sees an increased wagon procurement to benefit companies such as Titagarh Rail Systems Ltd and Jupiter Wagons Ltd. In the infrastructure space, Rail Vikas Nigam Ltd (RVNL) Ltd and IRCON International Ltd stand to benefit, the broking firm said in its latest note. The railway expenditure for the financial year 2024-25 (FY25) is pegged at Rs 2.6 lakh crore. The icing on the cake is that export opportunities are popping up as well, Antique said. \"After winning orders from Mozambique (Rs 300 crore) and Bangladesh (Rs 830 crore), RITES has the potential for new inflows from Zimbabwe (Rs 850 crore), where negotiations are yet to translate into a LoA. RVNL too has submitted expression of interest to Botswana Railways, then the Namibia Trans Kalhari project team,\" it noted. For the June quarter, Antique Stock Broking expects revenue for its coverage universe (five companies) to register 12 per cent YoY growth on account of strong growth in the wagon manufacturing space. The construction segment may pick up going ahead as orders flow in after the recently concluded union elections, it said. \"We expect margins to remain flat at 8.2 per cent for our coverage universe impacted by margin contraction in RITES (187 bps, due to increased competitive bidding). However, we expect wagon manufacturers to report a 42 bps and an 18 bps YoY expansion for Titagarh and Jupiter Wagons respectively. We expect our coverage universe to report 17 per cent YoY increase in PBT and 21 per cent YoY increase in PAT for the quarter,\" it said. At the aggregate level, the outlook on capex and ordering activity (especially international ordering), and execution traction of the new projects won would be key monitorable going ahead, Antique said while suggesting Titagarh Rail Systems and RITES as its top stock picks. "}, {"url": "https://www.businesstoday.in/markets/company-stock/story/rvnl-shares-gain-on-order-win-from-central-railways-435525-2024-07-03?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Shares of state-run Rail Vikas Nigam Ltd (RVNL) are in news today after the PSU said it won an order from the Central Railways. RVNL shares rose over 1.5%  to Rs 417.50 in early deals today against the previous close of Rs 411.10 on BSE. The state-owned rail infrastructure firm said it has been declared the lowest bidder for overhead equipment (OHE) modification work for upgrading the existing 1 x 25-kilovolt electric traction system to a 2 x 25-kilovolt AT feeding system in the Wardha-Ballarshah section of the Nagpur division of Central Railway to meet a loading target of 3,000 MT. The total cost of the order is Rs 132.59 crore, which is likely to be finished in two years. RVNL shares have a one-year beta of 1.5, indicating high volatility during the period. In terms of technicals, the relative strength index (RSI) of RVNL stands at 65, signaling it's trading neither in the overbought nor in the oversold zone. Rail Vikas Nigam shares are trading higher than the 5 day, 10 day, 20 day, 30 day, 50 day, 100 day, 150 day and 200 day moving averages. RVNL is an executing arm of Indian Railways and works for and on behalf of the ministry for projects assigned to it for execution. It works on a turnkey basis and undertakes the full cycle of project development from conceptualisation to commissioning including stages of design, preparation of estimates, calling and award of contracts, project and contract management. "}, {"url": "https://www.businesstoday.in/markets/story/stocks-in-news-vraj-iron-yes-bank-rvnl-zomato-hdfc-bank-hcl-tech-iex-and-d-mart-435516-2024-07-03?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Indian benchmark indices ended a volatile trading session on Tuesday on a flat note on the back of mixed global cues. BSE Sensex shed 34.74 points, or 0.04 per cent to end at 79,441.45. NSE's Nifty50 index gave up 18.10 points, or 0.07 per cent, to settle at 24,123.85 for the day. Here are the stocks that may remain under spotlight before the opening bell on Wednesday, July 03, 2024 Vraj Iron and Steel: Shares of the metal player will make its Dalal Street debut on Wednesday after raising Rs 171 crore via IPO, which was open for bidding between June 26 and June 28. The company sold its shares in the range of Rs 195-207 apiece. The current GMP for the stock stood at Rs 50 per share. HDFC Bank: The private lender's June 2024 quarter shareholding data shows that FII holdings in the bank fell to 54.83 per cent from 55.54 per cent at the end of the March quarter, raising the possibility of a likely increase in its weightage in the MSCI indices. Experts expect the lender to get FII inflows around $3-4 billion. HCL Technologies: The global technology company launched its global delivery center in Patna. The center will focus on the delivery of IT and engineering services for Hi-Tech and semiconductor companies. Indian Energy Exchange: The electricity exchange achieved an electricity volume of 10,185 MU in June 2024, marking a 24.7 per cent YoY increase. Green market volume stood at 744 MU for June 2024, growing 173.4 per cent over 272 MU in June 2023. YES Bank: The private sector lender recorded 14.8 per cent YoY growth in loans and advances at Rs 2.29 lakh crore for Q1FY25. Deposits grew by 20.8 per cent YoY to Rs 2.64 lakh crore during the quarter, as per provisional data. Avenue Supermarts: The standalone revenue from operations of D-Mart's operator for the quarter ended June FY25 stood at Rs 13,711.87 crore, growing 18.4 per cent over revenue of Rs 11,584.44 crore in Q1FY24. The total number of stores as of June 2024 stood at 371. Hindustan Zinc: The mining and metal production in Q1FY25 at 2.63 lakh tonnes grew by 2 per cent YoY with improved mined metal grades. Saleable metal production at 2.62 lakh tonnes inched up by 1 per cent YoY. Refined zinc production rose merely 1 per cent YoY to 2.11 lakh tonnes and refined lead production increased by 2 per cent to 51,000 tonnes during the quarter. Zomato: The food delivery platform's subsidiary Zomato Financial Services has decided to voluntarily withdraw the application submitted to the Reserve Bank of India for getting a certificate of registration for undertaking the business of a non-banking financial company (Type II NBFC-ND), as it does not wish to pursue the lending business anymore. Aditya Birla Capital: The company has received no objection letters from the exchanges for the merger of Aditya Birla Finance with itself. Mahindra & Mahindra Financial Services: The shadow-lender estimated the overall disbursement at approximately Rs 4,370 crore, delivering a 3 per cent YoY growth in June 2024 quarter. Q1FY25 disbursement at about Rs 12,730 crore grew by 5 per cent YoY. The collection efficiency was at 95 per cent for June 2024, against 96 per cent for June 2023. Motilal Oswal Financial Services: The broking company has received an administrative warning from the capital markets regulator SEBI. The regulator advised the company to be careful in the future regarding minor operational matters. This letter has been issued by SEBI with respect to the examination carried out of the stock broking activities of the company. MOIL: The manganese ore mining company has recorded sales growth of 14.5 per cent YoY for the June FY25 quarter, with record quarterly production of 4.70 lakh tonnes in Q1FY25, reporting a 7.8 per cent YoY growth. KEC International: The global infrastructure EPC major has secured new orders worth Rs 1,017 crore in T&D and renewables businesses. The transmission and distribution business has secured orders for an EPC project and the supply of towers in the Middle East. Rail Vikas Nigam: RVNL has emerged as the lowest bidder for a contract worth Rs 132.6 crore from Central Railway. The contract involves OHE modification work for the up-gradation of the existing 1 x 25 kV electric traction system to a 2 x 25 kV AT feeding system in the Wardha-Ballarshah Section in Nagpur division of Central Railway to meet the 3000 MT loading target. Piramal Enterprises: The NBFC's subsidiary Piramal Capital & Housing Finance has received a 'no comments letter' from the India International Exchange (IFSC) Limited (India INX) for the establishment of a Euro Medium Term Note Programme. "}, {"url": "https://www.businesstoday.in/markets/stocks/story/yes-bank-ircon-irfc-paytm-adani-green-rvnl-sjvn-among-65-shares-meeting-new-fo-eligibility-criteria-434986-2024-06-28?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "YES Bank Ltd, IRCON International Ltd, One 97 Communications Ltd (Paytm) Adani Green Energy Ltd, Rail Vikas Nigam Ltd (RVNL), IRFC, and SJVN Ltd are among five dozen stocks that meet the new eligibility criteria for futures and options (F&O) inclusion. Sebi has revised the thresholds for stocks entering or exiting the F&O segment by revising the criteria. The Median Quarter Sigma Order Size (MQSOS) requirement over the last six months has been increased to Rs 75 lakh from Rs 25 lakh on a rolling basis. The Market Wide Position Limit (MWPL) has been raised to Rs 1,500 crore from Rs 500 crore . The regulator also stipulates that the Average Daily Value (ADV) over the last six months must not fall below Rs 30 crore, compared to the previous threshold of Rs 10 crore. They included Zomato Ltd, Jio Financial Services Ltd, NHPC Ltd, Adani Green Energy Ltd, IRFC Ltd, Varun Beverages Ltd, Union Bank Ltd and BSE Ltd. Adani Total Gas Ltd, Adani Energy Solutions Ltd, RVNL Ltd Paytm Ltd, LIC, Avenue Supermarts and JSW Energy are some other stocks that could see F&O inclusion. Bank of India, SJVN, Oil India, Cochin Shipyard, IRCON International, Mazagon Dock, Swan Energy and Kalyan Jewellers Ltd are other stocks that Nuvama sees in the eligible list. As per Nuvama, stocks suchb as Balrampur Chini, Can Fin Homes, GNFC Gujarat Gas, IPCA Labs, L&T Technology, The Ramco Cement, Muthoot Finance, Torrent Pharma and United Breweries could also see exits, as per Nuvama's analysis on best-effort basis. "}]