[{"url": "https://www.businesstoday.in/bt-tv/video/bengaluru-police-have-swung-into-action-and-arrested-three-suspects-based-on-the-fsl-report-420120-2024-03-05?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": " Three people have been arrested for allegedly raising pro-Pakistan slogans inside the Karnataka assembly following a Congress candidate's victory in the Rajya Sabha elections last week. A forensic report has confirmed that the video of the incident was not doctored and that pro-Pakistan slogans were indeed raised in the assembly. Here's a report. "}, {"url": "https://www.businesstoday.in/latest/story/kannada-actor-darshans-bengaluru-home-raided-amid-row-over-tiger-claw-pendant-403279-2023-10-25?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Karnataka's forest department is conducting searches at the home of Kannada actor Darshan Thoogudeepa Shrinivas after an image of him allegedly wearing a 'tiger claw pendant' around his neck went viral on social media, India Today reported. The pictures that have surfaced online are allegedly from the actor's recent visit to Sri Kshetra Horanadu temple. The search by the forest department comes after a complaint was lodged by a Janata Party worker. During the search, a tiger-claw-like material was found from the actor's Bengaluru home. The material will be sent to the Forensic Science Laboratory (FSL) for inspection. Earlier today, PTI reported that actor Darshan and BJP Rajya Sabha MP Jaggesh were under scanner after complaints were filed against them for possession of wildlife articles. Teams of senior officials from the state's forest department visited various places to probe celebrities against whom complaints have been received. Karnataka Environment and Forest Minister Eshwar Khandre said the law of the land is applicable to all without any discrimination and the government will act as per the law. Earlier on Sunday, Bigg Boss Kannada reality show contestant Varthur Santosh was arrested from the set for allegedly wearing a tiger claw pendant. He was later sent to 14 days in judicial custody. Following his arrest, some photos of Kannada film actor Darshan, actor-turned-politician Jaggesh, and JD(S) leader Nikhil Kumaraswamy purportedly wearing such pendants also surfaced on social media. Nikhil Kumaraswamy, the son of former chief minister HD Kumaraswamy, clarified that the tiger claw pendant that he was seen wearing was fake. \"It has been reported in some media that Nikhil Kumaraswamy wore a Tiger claw pendant during his marriage. This is far from the truth. I am certainly aware of the seriousness of the Wildlife Protection Act. The Tiger claw pendant I was wearing was fake, not real. It was given as a gift for my marriage. I still have it. Concerned authorities can verify,\" he said in a statement on 'X'. Additional Principal Chief Conservator of Forests (Wildlife), Kumar Pushkar, said the department has received a formal complaint against Darshan, leading producer Rockline Venkatesh, Jaggesh, Venkateshwara Swamy in Kunigal and Vinay Guruji in Chikkamagaluru among others. \"We are verifying all these cases which have come to our notice through the media and several organisations which were received by us this morning. So, we are verifying each and every one of them and we will take action as per the Wildlife Protection Act wherever we find that the person actually possesses such wildlife articles,\" he told PTI. "}, {"url": "https://www.businesstoday.in/markets/stocks/story/pnb-bank-of-baroda-fsl-indus-tower-how-should-you-trade-these-buzzing-stocks-390106-2023-07-18?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Domestic equity markets continued to move higher on Friday and ended the week with big gains, thanks to buying action in IT stocks and better-than-expected Q1 earnings by India Inc. BSE Sensex surged more than 502 points, or 0.77 per cent, to end at 66,060.90, settling for the first time above 66,000-mark on the closing basis. NSE's Nifty50 gained 150.75 points, or 0.78 per cent, to close at 19,564.50.\n\nSelect stocks such as Punjab National Bank, Firstsource Solutions, Bank of Baroda and Indus Towers are likely to remain under the spotlight on Dalal Street for the session today ahead of the result season. Here is what a number of analysts from various brokerage firms have to say on these stocks ahead of Tuesday trading session:\n\nBank of Baroda | Buy | Target Price: Rs 211-214 | Stop Loss: Rs 195.5\nBank of Baroda experienced an upward movement after forming a bullish harami pattern on the daily chart. It found support at the 21-day Exponential Moving Average (EMA), indicating potential buying interest. The Relative Strength Index (RSI) is displaying a bullish crossover, suggesting further upside potential. The stock has support at Rs 195.50, while resistance is expected in the range of Rs 211-214, which could pose a barrier to further price appreciation.\nRecommended by: Kunal Shah, Senior Technical and Derivative analyst at LKP Securities\n\nPunjab National Bank | Buy | Target Price: Rs 80-100 | Stop Loss: Rs 55-56\nPNB has given a breakout. In our last two weeks, stock has given a good return of almost 10 per cent and again the stock has come near the 52-week high of Rs 62. On the weekly chart, the stock is on the verge of giving a breakout above 62 zone with near term support of Rs 55-56. We are expecting the level of Rs 80-100 in the coming weeks.\nRecommended by: Vaishali Parekh, Vice President - Technical Research, Prabhudas Lilladher Firstsource Solutions | Buy | Target Price: Rs 159 | Stop Loss: Rs 132\nFSL had witnessed a vertical rise from March 2020 low at Rs 18.55 and scaled to a new record high at Rs 231.34 in July 2021. It retraced gradually after that strong rally and consolidated in a tight range of Rs 95-120 levels for a year while holding firmly above the support zone of long-term moving average that is 200 EMA on the weekly chart. It ended that consolidation phase in May 2023 with a breakout. After the initial surge, it retraced marginally while trading in a flag formation and finally resumed the trend today. We thus recommend creating fresh longs in the mentioned range.\nRecommended by: Religare Broking\n\nIndus Towers | Buy | Target Price: Rs 190-200 | Stop Loss: Rs 160\nIndus Tower has recently experienced a breakout on the daily chart, accompanied by a sharp surge in trading volumes. This breakout suggests a potential change in the stock's price trend. Additionally, the stock has surpassed its previous 10-day high, indicating increasing upward momentum and strength in its price movement. The momentum indicator RSI has also shown a positive crossover, further confirming the bullish sentiment surrounding the stock. A support level is observed at Rs 160, which may act as a floor for the stock price. Traders and investors may consider this support level when determining their risk management and stop-loss levels. The stock's potential upside targets are projected at Rs 190 and Rs 200, indicating possible price appreciation in the future.\nRecommended by: Kunal Shah, Senior Technical and Derivative analyst at LKP Securities\n\n\n(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Business Today.)  Also read: IndusInd Bank Q1 results today. Earnings preview, share price target & more Also read: Rs 51 to Rs 971: This IT stock turned into a multibagger in three years  "}, {"url": "https://www.businesstoday.in/latest/trends/story/did-not-stop-the-car-because-heres-what-the-accused-told-delhi-cops-in-kanjhawala-case-359344-2023-01-08?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "Delhi car horror: In a new development, the suspects in the Delhi Kanjhawala hit-and-run case told the police they were aware that a woman was trapped under a car but kept driving the car as they were afraid. The vehicle made multiple U-turns in Delhi's Kanjhawala area and the woman was dragged by the speeding car from Sultanpuri. The accused knew that a case of murder would be filed against them if they had stopped the car and rescued the woman, police said as per India Today. Anjali Singh, who was killed on new year's night in Delhi after her scooty was hit by a Baleno car with five men in it, got stuck onto the left front wheel of the car as per a report by Forensic Science Laboratory (FSL). She was dragged by the car for about 12 kms. As per the police, the accused were extremely scared due to which they kept driving till the woman's body fell off. Earlier, it was reported that the accused had told the police that there was loud music inside the car, so they did not notice the body. However, the accused reportedly confessed that these were false statements. Earlier, Singh's family claimed that she did not consume alcohol on the night of the incident. Singh’s family refuted the claims made by her friend Nidhi, who was present at the scene when the accident took place. Nidhi, who fled from the spot after the incident, had claimed that Anjali Singh was in a drunken state but insisted on driving the two-wheeler. Anjali's mother also said that she had never seen Nidhi with her daughter, nor had the woman visited their home, according to a report by India Today. She further accused Nidhi of being part of a conspiracy. “I never saw or heard of Nidhi. She never visited our home. If she was my daughter’s friend, how could she leave her and run away? This is a well-thought-out conspiracy. Nidhi may also be involved in this. This should be thoroughly investigated,” she said. Singh's autopsy report revealed that she had multiple external injuries and her brain matter was missing. Her ribs were exposed from her back as skin peeled away, her lungs had popped out, the base of her skull was fractured and some brain matter was missing. Seven men -- Deepak Khanna, Manoj Mittal, Amit Khanna, Krishan, Mithun, Ashutosh (owner of the car), and Ankush -- have been arrested. Ashutosh and Ankush were arrested today for trying to help the other five men in a cover-up. The autopsy report of the deceased woman has ruled out the possibility of sexual assault. Also Read: Delhi accident updates: Owner of Baleno arrested; there were 4 men in the car, not 5  "}, {"url": "https://www.businesstoday.in/markets/company-stock/story/rakesh-jhunjhunwala-picked-up-stocks-during-june-quarter-stock-holding-stood-rs-11549-cr-267878-2020-07-22?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "During the April-June quarter when the domestic stock market was grappling with the impact of coronavirus pandemic, billionaire Rakesh Jhunjhunwala was busy picking up stake in the most unpopular, most battered stocks. The ace investor, who is referred as the 'Warren Buffett of India', acquired stake in some small cap stocks such as Dishman Carbogen Amcis, Autoline Industries, and Indian Hotels during the quarter ended June 30, 2020. As per the latest shareholding pattern available on the exchange, Jhunjhunwala hiked his holding in Rallis India, Federal Bank, Edelweiss Financial Services, NCC, Jubilant Life Sciences, Delta Corp and Firstsource Solutions (FSL), while cut his stake in Lupin and Agro Tech Foods. His stake in 13 other companies, including Titan Company, Escorts, ION Exchange, Crisil, Fortis Healthcare and Orient Cement, Multi Commodity Stock Exchange of India, remained unchanged during the first quarter of the current fiscal. According to corporate shareholdings filed for June 30, 2020, Rakesh Jhunjhunwala publicly holds 33 stocks with a net worth of over Rs 11,549.3 crore, showed data available on Trendlyne, a stock market investment platform. The net worth of Jhunjhunwala has increased by Rs 316.3 crore from Rs 11,233 crore at the end of March quarter. Also Read: Rakesh Jhunjhunwala buys 50 lakh shares of this firm, stock gains 5% Among the fresh portfolio, Jhunjhunwala and his wife Rekha each acquired 1.59 per cent stake or 25 lakh equity shares in Dishman Carbogen Amcis. Together, they hold a 3.18 per cent stake in the small cap company. The Big Bull also added Indian Hotels in his portfolio, acquiring 1.05 per cent stake or 1.25 crore shares in June quarter. Interestingly, it was Autoline Industries, a specialist product development and engineering company, where Rakesh Jhunjhunwala made his highest fresh investment. He purchased 10.20 lakh equity shares or 3.77 stake in the company, while his wife Rekha picked 2.71 per cent or 7.31 lakh equity shares in the company. Together they hold 6.48 per cent shares in Autoline as on June 2020. Also Read: This pharma stock hit 52-week high after Rakesh Jhunjhunwala raised stake in Q1 Meanwhile, Jhunjhunwala raised his stake in Rallis India, a subsidiary of Tata Chemicals, by 0.38 per cent during June quarter. He purchased an additional 7.25 lakh equity shares to raise his stake to 10.31 per cent during the April-June period. He holds shares in the Tata Group company through his two accounts -- Rakesh Radheshyam Jhunjhunwala (7.64 per cent) and Rakesh Jhunjhunwala (2.67 per cent), the data of shareholding pattern on BSE showed. Also Read: Federal Bank share price gains 4% after Rakesh Jhunhjunwala raises stake in Q1 Among others, he raised his stake in NCC by 1.23 per cent to 11.45 per cent in the April - June 2020 quarter. He increased his stake In Jubilant Life Sciences by 0.70 per cent to 5.11 per cent, Federal Bank by 0.10 per cent 3.18 per cent, Firstsource Solutions by 0.82 per cent to 2.88 per cent, Edelweiss Financial Services by 0.15 per cent to 1.19 per cent and Delta Corp by 0.06 per cent to 7.44 per cent.    "}, {"url": "https://www.businesstoday.in/pti-feed/story/cbi-books-former-deputy-director-of-fsl-for-aiding-accused-230005-2019-09-27?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "New Delhi, Sep 27 (PTI) The CBI has booked former deputy director of the Forensics Science Laboratory (FSL), Rohini, AK Shrivastava along with a senior scientific officer for alleged inconsistencies in their opinions on DNA testing in three rape cases which helped accused, officials said on Friday. In the three cases -- two related to rape and one to unnatural sex and murder -- the opinions given by the officers were found to be inconsistent, which may have helped the accused during the trial, the FIR has alleged.It said they have prepared incorrect record with an intent to save the accused of the above mentioned cases from legal punishment. The Central Bureau of Investigation (CBI) has alleged that an enquiry has prima facie established that reports and opinion given by L Babyto Devi and Srivastava in the cases are inconsistent with the reports given subsequently by experts of FSL, Rohini and experts of CFSL CBI, New Delhi.\"It appears that L Babyto Devi and A K Srivastava either have deliberately or dishonestly given false or incorrect reports by abusing their official position with object to give undue benefit to accused persons of above mentioned cases,\" the CBI FIR alleged.The cases were probed by Delhi Police, which were registered in 2012-13. The Badarpur rape case pertained to 2013 while Samaypur Badli case was reported in 2012.The unnatural sex case was registered in the Mahindra Park police station in 2012.In the Badarpur rape case, Devi had said DNA of the accused found on his undergarments did not match the DNA collected from the victim, which was found incorrect during review by FSL experts and the Central Forensics Science Laboratory under the CBI.Similarly, in the unnatural sex case the DNA profile of the accused developed by Devi and Shrivastava differed, which is scientifically not possible.In the Samaypur Badli case also the DNA profile developed by Shrivastava and CFSL experts was different making the report \"suspicious\", it alleged. They have also not preserved the exhibits and electropherogram with an intention of screening the offender of the above mentioned cases from legal punishment, the FIR alleged. PTI ABS KJ "}, {"url": "https://www.businesstoday.in/pti-feed/story/delhi-fsl-to-have-operational-brain-fingerprinting-system-in-june-hc-told-200166-2019-05-26?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "New Delhi, May 26 (PTI) The forensic science lab at Rohini here will have a brain fingerprinting machine operational in June this year, police has told the Delhi High Court.Brain fingerprinting is a type of lie-detection technique through which a person's brain waves are measured to find out if the individual is telling the truth when answering questions put to him or her.The high court had in March directed installation of the system at the Rohini FSL during the hearing of a plea related to a missing four-year-old boy after it was informed there were no facilities here for carrying out narco tests.On May 20, the court was informed that the machine has been installed and it will be operational after May 31, by when the electrical work would be completed.The court had called for the system to examine the mother and sister of the main suspect, a young boy of around 11 years, who was last seen with the missing child according to CCTV footage.A narco test of the two women was scheduled to be carried out at Gandhinagar FSL in Gujarat in March, but due to medical reasons could not be done and was re-scheduled to September, the high court noted in its order.The four-year-old boy has been missing since August 4 last year, when he was last seen with the juvenile.Subsequently, the child's father moved a habeas corpus petition in the high court, seeking directions to police to trace his son.According to the juvenile, the child drowned in the river Yamuna, but as no body was recovered, the investigation continued.As police could not trace the child till December last year, the court transferred the case to the anti-human trafficking unit of the crime branch. PTI HMP SKV ABHABH "}, {"url": "https://www.businesstoday.in/pti-feed/story/dcw-issues-notice-to-fsl-seeking-details-of-pendency-of-cases-184852-2019-04-03?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "New Delhi, Apr 3 (PTI) The Delhi Commission For Women (DCW) Wednesday issued a notice to Forensic Science Laboratory (FSL) in the national capital and sought details about the pendency of cases as well as the reasons for the delay.Delhi continues to witness a high rate of crime against women and children, the DCW said, adding that the major cause for this is the lack of deterrence arising out of low conviction rate in such cases. The Commission had visited the FSL in Rohini and given recommendations to address the issues, specially pendency, that the laboratory was contending with. Till date no action taken report has been submitted by the FSL, the Commission said. In its notice, the Commission has sought the latest data of cases (category-wise) pending at the FSL with month wise pendency from January 2017 till date.The Commission has also asked the FSL how many cases it has forwarded to other labs every year since January 2017 and in how many cases the report is awaited.To ascertain the reason for pendency, the Commission has asked the FSL to submit the number of posts (regular and contractual) filled in the lab since January 2017, the number of posts vacant as on date and details of these posts. PTI SLB SLB TDSTDS "}, {"url": "https://www.businesstoday.in/pti-feed/story/gaming-startup-fsl-is-ready-for-ipl-creating-new-earning-opportunities-for-players-179417-2019-03-11?utm_source=topic&utm_medium=topic&utm_campaign=topic", "article": "(Eds: Disclaimer: The following content is a press release. PTI takes no editorial responsibility for the same.) Mumbai, 11th March 2019: Winning Combo Private Ltd. launches its new fantasy gaming platform, Fan Super League or FSL, aiming to provide the fantasy sports users as well as beginners a unique and flawless gaming experience. The app will be available from today. A Fantasy Cricket App, where users can create their own Fantasy Cricket Team based on the upcoming actual cricket match, including the entire international as well as the domestic leagues prevailing across the globe. Users can join multiplayer contests or can play amongst their family and friends also. There are no age criteria for mobile literate users. Every customer will have a unique referral code which can be used to earn referral money and keep playing. Mr. Nitin Nachnani says, We, at FSL, aims to give the best experience to our users. The App has been developed keeping in mind the growing Indian gaming industry and have made sure to stand out from our competitors in terms of gaming structure, points system and unique features such as notifications widgets and Quiz Module in our App. Along with that, the App has lots of bonuses on offer. Going forward \"QUIZ\" feature will also be integrated in a couple of months, wherein users can play amongst themselves real-time and win cash money. The Fan Super League is a fantasy gaming application which provides the opportunity to drag in skills of sports and to win cash rewards for participating in various contests. Users can enter open contests challenging other players across India or can also create their own contests and challenge colleagues, family members or friends to win umpteen rewards with very low contest entry costs. In addition, if players are not up for participating in the days match, they can also win by playing the one on one quiz; tests general knowledge of the game. This feature will be introduced shortly. Mr. Nitin Nachnani further adds, We are excited to introduce the Fan super League App for Indian sports lovers complementing the fantasy gaming industry. Being different is the key when it comes to creating a brand identity for your product. The app is Android, IOS and Web-based. FREE to download. Join Cash contests and win loads of money and prizes by using the cricketing knowledge to the fullest filling cricket fantasy. With a vision to keep upgrading with exciting new features every month such as Widget and Quiz also FSL is ready for IPL. More sports such as Football, Hockey, Kabaddi, NBA to follow. According to the information, Winning Combo Private Limited looks forward to generating approx. 20 million USD and will acquire 20% of the market share becoming a brand to reckon with in the next 5 years. The company has been approached by quite a few cooperate investors with seed funding for application building and operation cost of around 10 million rupees.About The Company: Winning Combo Private Limited is a newly established B2C company with an aim to become industry leaders and trend creators in gaming and application Industry. The company is rooted by the directors with expertise in the diverse background and a team of well-trained professionals idealizing the next gaming experience, extending the entertainment value of the sport. The Foundation & Ideation are driven from actual research, feedbacks and first-hand information from the real users. The gameplay and elements incorporated in the product are what the user actually would want to see and experience. We are constantly connected to our user base from all strata of the society. Winning Combo Private Limited is trying to empower FAN SUPER LEAGUE with sports vertical like sportswear, creating cricket leagues for Amateur as well as professional cricket players. For complete Marketing and Advertising Services, Fan Super League has hand-picked Albatross Media & Entertainment and to provide best user base platform, they have collaborated with RAZORPAY, PAYTM, CASHFREE, MSG91 andIndSoft Inc. PWRPWR "}]